#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

module.networking.aws_vpc.vpc: Refreshing state... [id=vpc-0e0c633e556405c5b]
module.s3.aws_s3_bucket.lambda_s3: Refreshing state... [id=tech-challenge-soat1-grp13-s3-auth]
module.databases.aws_dynamodb_table.customer_db: Refreshing state... [id=customers_cache]
module.networking.aws_internet_gateway.ig: Refreshing state... [id=igw-0e633156cbe9a0d0a]
module.networking.aws_security_group.tech_challenge_sg: Refreshing state... [id=sg-0bde097ab5cd55b09]
module.networking.aws_route_table.public: Refreshing state... [id=rtb-0103dded79e5f5acf]
module.databases.aws_security_group.rds-postgres-sg: Refreshing state... [id=sg-057f01664ce25922c]
module.networking.aws_subnet.public_subnet[0]: Refreshing state... [id=subnet-0b8fec9737082a00a]
module.networking.aws_subnet.public_subnet[1]: Refreshing state... [id=subnet-092f2bda749033826]
module.networking.aws_route_table.private: Refreshing state... [id=rtb-09716175b16e4cc39]
module.networking.aws_subnet.private_subnet[0]: Refreshing state... [id=subnet-05299be6bfda232d8]
module.networking.aws_subnet.private_subnet[1]: Refreshing state... [id=subnet-08904847fa9a1131b]
module.networking.aws_route.public_internet_gateway: Refreshing state... [id=r-rtb-0103dded79e5f5acf1080289494]
module.networking.aws_db_subnet_group.db_subnet: Refreshing state... [id=db_subnet_group]
module.networking.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-006b7b2d0a1601841]
module.networking.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-01c24790e6a2ee28d]
module.networking.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-028357546b3b2f9b0]
module.networking.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-035bb6c66c2ca3f57]
module.databases.aws_db_instance.postgresql_db: Refreshing state... [id=db-BM5HOXJHDF34V4CATK3QIVFTOQ]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.secrets.aws_secretsmanager_secret.secrets will be created
  + resource "aws_secretsmanager_secret" "secrets" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "soat1-grp13"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags_all                       = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @luiz-soh, Action: `pull_request`*